"""
思考过程，任意两日期之间的天数 = 分别计算出这两个日期距离公元1年1月1日的总天数（绝对天数）然后算差值，必要时需要使用绝对值函数abs()

程序用途，养成类，模拟经营游戏，挂机游戏，用于计算玩家进入游戏是距离上次存档日期过了多少天，根据这些天数计算挂机的金币收入等
"""
def 平闰年计算(年):
    # 如果是整百年份
    if 年 % 100 == 0:
        if 年 % 400 == 0:
            return "闰年"
        else:
            return "平年"
    # 普通年份（非整百）
    else:
        if (年 % 4 == 0):
            return "闰年"
        else:
            return "平年"

def 当月天数(年, 月):
    大月列表 = [1,3,5,7,8,10,12]
    if 月 == 2 and 平闰年计算(年) == "闰年":
        return 29
    elif 月 == 2 and 平闰年计算(年) == "平年":
        return 28
    elif 月 in 大月列表:
        return 31
    else:
        return 30

def 绝对天数(年, 月, 日):
    # 计算从公元1年1月1日到该日期的总天数（绝对天数）
    绝对天数 = 0
    # 第几年对应的天数就是第几年*365或者366
    for year in range(1, 年):
        if 平闰年计算(year) == "平年":
            绝对天数 += 365
        elif 平闰年计算(year) == "闰年":
            绝对天数 += 366
    for month in range(1, 月):
        绝对天数 += 当月天数(年, month)
    绝对天数 += 日
    return 绝对天数

# y1 m1 d1：年 月 日
# y2 m2 d2: 年 月 日
def main(y1, m1 ,d1, y2, m2, d2):
    days1 = 绝对天数(y1, m1 ,d1)
    days2 = 绝对天数(y2, m2 ,d2)
    return abs(days2 - days1)

print(main(2026, 7, 1, 2026, 8, 7))
print(main(2024, 2, 28, 2024, 3, 1))
print(main(2023, 2, 28, 2023, 3, 1))
